#!/usr/bin/env python
# !-*-coding:utf-8 -*-
# !time :  14:42
# !@Author : SweetBeaner
# !@File :.py
# !@Information :练习算数运算符

# 算数运算符

# +	加	两个对象相加 a + b 输出结果 30
# -	减	得到负数或是一个数减去另一个数 a - b 输出结果 -10
# *	乘	两个数相乘或是返回一个被重复若干次的字符串 a * b 输出结果 200
# /	除	b / a 输出结果 2
# //	取整除	返回商的整数部分 9//2 输出结果 4 , 9.0//2.0 输出结果 4.0
# %	取余	返回除法的余数 b % a 输出结果 0  ***
# **	指数	a**b 为10的20次方， 输出结果 100000000000000000000

# ==============根据以下注释，完成相关的代码练习==========

# 定义两个int类型的变量，完成 + 操作并输出结果
num1 = 1
num2 = 2
print(num1 + num2)

# 定义两个int类型的变量，完成 - 操作并输出结果
num3 = 3
num4 = 4
print(num4 - num3)

# 定义两个int类型的变量，完成 * 操作并输出结果
num5 = 5
num6 = 6
print(num5 * num6)

# 定义两个int类型的变量，完成 / 操作并输出结果
num7 = 7
num8 = 8
print(num7 / num8)

# 定义两个int类型的变量，完成 // 操作并输出结果
num9 = 9
num10 = 10
print(num9 // num10)

# 定义两个int类型的变量，完成 % 操作并输出结果
num10 = 10
num11 = 11
print(num10 % num11)

# 定义两个int类型的变量，完成 ** 操作并输出结果
num12 = 2
num13 = 3
print(num12 ** num13)
